tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/constant/pyrolysisZones
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      pyrolysisProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pyrolysis
{
    active          true;

    pyrolysisModel  reactingOneDim;

    regionName pyrolysisRegion;

    reactingOneDimCoeffs
    {
        filmCoupled     true;

        gasHSource      true;
        qrHSource       false;

        radFluxName     qr;

        moveMesh        false; // true;
        minimumDelta    1e-6;

        useChemistrySolvers    true;
    }
}


// ************************************************************************* //
